Revit 2026 API

# PlanTopologySetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PlanTopologySetIterator()
```
```vb
Public Sub New
```
```cpp
public:
PlanTopologySetIterator()
```
```fsharp
new : unit -> PlanTopologySetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

PlanTopologySetIterator Class

Autodesk.Revit.DB Namespace